app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {

        // Do something here
        $session = session();
        helper("global_helper");

        $user = new UserModel();
        $sesi_id = $session->get('member_id');
        $userRole = $user->where('id', $sesi_id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '36'
 LIMIT 1