app/Controllers/Inventory/DataBarangController.php

    public function index()
    {
        $Barang = new InventoryModel();
        $data = [
            'dataBarang' => $Barang->paginate(10, 'barang'),
            'pager' => $Barang->pager,
            'aktif_data_barang' => 'active',
            'aktif_barang' => 'active'
        ];
---
SELECT *
FROM `inventories`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `inventories`