app/Controllers/Inventory/DataPinjamanController.php

    public function pinjaman()
    {
        // melarang admin akses halaman ini
        if (session('redirected') != 'user') {
            return redirect()->back();
        }

        $sesi_email = session()->get('member_email');
        $pinjaman = new PinjamanModel();
        $inventori = new InventoryModel();
        $dataPinjaman = $pinjaman->where('email', $sesi_email)->orderBy('id', 'desc')->paginate(10, 'pinjaman');
        $data_barang = $pinjaman->where('email', $sesi_email)->orderBy('id', 'desc')->findAll();
        $data = [
            'aktif_pinjaman' => 'aktif',
            'pinjaman' => $dataPinjaman,
            'pager' => $pinjaman->pager,
            'inventori' => $inventori->findAll(),
            'data_barang' => $data_barang
        ];
---
SELECT *
FROM `pinjaman`
WHERE `email` = 'pain696987@gmail.com'
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pinjaman`
WHERE `email` = 'pain696987@gmail.com'
SELECT *
FROM `pinjaman`
WHERE `email` = 'pain696987@gmail.com'
ORDER BY `id` DESC
SELECT *
FROM `pinjaman`
WHERE `email` = 'pain696987@gmail.com'
SELECT *
FROM `inventories`

    public function kembalikan()
    {
        $id_barang = $this->request->getVar('kembalikan_barang');
        $jumlah = $this->request->getVar('jumlah');
        $pinjaman = new PinjamanModel();
        $inventori = new InventoryModel();

        $cek_data = $pinjaman->where('id', $id_barang)->first();
        $cek_inventori = $inventori->where('kode_barang', $cek_data['kode_barang'])->where('kondisi_barang', $cek_data['kondisi_barang'])->first();
        if ($jumlah > $cek_data['jumlah_barang']) {
            notif_swal('error', 'Jumlah melebihi stock');
            return redirect()->back();
        } else if ($jumlah == $cek_data['jumlah_barang']) {
            if ($cek_inventori) {
                $update = [
                    'jumlah_barang' => $cek_inventori['jumlah_barang'] + $jumlah,
                ];
                $inventori->where('kode_barang', $cek_data['kode_barang'])->where('kondisi_barang', $cek_data['kondisi_barang'])->set($update)->update();
            } else {
                $inventori->insert([
                    'kode_barang' => $cek_data['kode_barang'],
                    'nama_barang' => $cek_data['nama_barang'],
                    'merk_barang' => $cek_data['merk_barang'],
                    'kondisi_barang' => $cek_data['kondisi_barang'],
                    'jumlah_barang' => $cek_data['jumlah_barang'],
                    'foto_barang' => $cek_data['foto_barang'],
                ]);
            }
            $pinjaman->delete($id_barang);
---
SELECT *
FROM `pinjaman`
WHERE `id` = '19'
 LIMIT 1
SELECT *
FROM `inventories`
WHERE `kode_barang` = '300199'
AND `kondisi_barang` = 'Baik'
 LIMIT 1
UPDATE `inventories` SET `jumlah_barang` = 41
WHERE `kode_barang` = '300199'
AND `kondisi_barang` = 'Baik'
DELETE FROM `pinjaman`
WHERE `id` IN ('19')